// Найти сумму всех чисел стоящих на нечетной позиции
Console.WriteLine("Hello, World!");
